spliced-components/src/Spliced/Component/Fedex/wsdl/ProcessShipmentRequest_DE_HAL_Sig_Opt_A_v10.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v10="http://fedex.com/ws/ship/v10">
   <SOAP-ENV:Header/>
   <SOAP-ENV:Body>
      <v10:ProcessShipmentRequest>
         <v10:WebAuthenticationDetail>
            <v10:UserCredential>
               <v10:Key></v10:Key>
               <v10:Password/>
            </v10:UserCredential>
         </v10:WebAuthenticationDetail>
         <v10:ClientDetail>
            <v10:AccountNumber></v10:AccountNumber>
            <v10:MeterNumber></v10:MeterNumber>
            <v10:IntegratorId>12345</v10:IntegratorId>
            <v10:Localization>
               <v10:LanguageCode>EN</v10:LanguageCode>
               <v10:LocaleCode>ES</v10:LocaleCode>
            </v10:Localization>
         </v10:ClientDetail>
         <v10:TransactionDetail>
            <v10:CustomerTransactionId>Hold shipment at the specified location</v10:CustomerTransactionId>
            <v10:Localization>
               <v10:LanguageCode>EN</v10:LanguageCode>
               <v10:LocaleCode>ES</v10:LocaleCode>
            </v10:Localization>
         </v10:TransactionDetail>
         <v10:Version>
            <v10:ServiceId>ship</v10:ServiceId>
            <v10:Major>10</v10:Major>
            <v10:Intermediate>0</v10:Intermediate>
            <v10:Minor>0</v10:Minor>
         </v10:Version>
         <v10:RequestedShipment>
            <v10:ShipTimestamp>2011-06-15T10:57:25-06:00</v10:ShipTimestamp>
            <v10:DropoffType>REGULAR_PICKUP</v10:DropoffType>
            <v10:ServiceType>PRIORITY_OVERNIGHT</v10:ServiceType>
            <v10:PackagingType>YOUR_PACKAGING</v10:PackagingType>
            <v10:Shipper>
               <v10:AccountNumber></v10:AccountNumber>
               <v10:Tins>
                  <v10:TinType>PERSONAL_STATE</v10:TinType>
                  <v10:Number>1057</v10:Number>
                  <v10:Usage>ShipperTinsUsage</v10:Usage>
               </v10:Tins>
               <v10:Contact>
                  <v10:ContactId>RBB1057</v10:ContactId>
                  <v10:PersonName>ROHIT BORSE</v10:PersonName>
                  <v10:Title>Mr.</v10:Title>
                  <v10:CompanyName>DEOYAROHIT0705$</v10:CompanyName>
                  <v10:PhoneNumber>9762308621</v10:PhoneNumber>
                  <v10:PhoneExtension>02033469</v10:PhoneExtension>
                  <v10:PagerNumber>9762308621</v10:PagerNumber>
                  <v10:FaxNumber>9762308621</v10:FaxNumber>
                  <v10:EMailAddress>Rohit*Borse@DeoyaRohit.com</v10:EMailAddress>
               </v10:Contact>
               <v10:Address>
                  <v10:StreetLines>SHIPPER ADDRESS LINE 1</v10:StreetLines>
                  <v10:StreetLines>SHIPPER ADDRESS LINE 2</v10:StreetLines>
                  <v10:City>COLORADO SPRINGS</v10:City>
                  <v10:StateOrProvinceCode>CO</v10:StateOrProvinceCode>
                  <v10:PostalCode>80915</v10:PostalCode>
                  <v10:UrbanizationCode>CO</v10:UrbanizationCode>
                  <v10:CountryCode>US</v10:CountryCode>
                  <v10:Residential>0</v10:Residential>
               </v10:Address>
            </v10:Shipper>
            <v10:Recipient>
               <v10:AccountNumber></v10:AccountNumber>
               <v10:Tins>
                  <v10:TinType>PERSONAL_STATE</v10:TinType>
                  <v10:Number>0705</v10:Number>
                  <v10:Usage>RecipientTinsUsage</v10:Usage>
               </v10:Tins>
               <v10:Contact>
                  <v10:ContactId>DRB0705</v10:ContactId>
                  <v10:PersonName>DEOYANEE BHADANE</v10:PersonName>
                  <v10:Title>Ms.</v10:Title>
                  <v10:CompanyName>DEOYAROHIT0705$</v10:CompanyName>
                  <v10:PhoneNumber>9762308621</v10:PhoneNumber>
                  <v10:PhoneExtension>02033469</v10:PhoneExtension>
                  <v10:PagerNumber>9762308621</v10:PagerNumber>
                  <v10:FaxNumber>9762308621</v10:FaxNumber>
                  <v10:EMailAddress>Deoyanee*Bhadane@DeoyaRohit.com</v10:EMailAddress>
               </v10:Contact>
               <v10:Address>
                  <v10:StreetLines>RECIPIENT ADDRESS LINE 1</v10:StreetLines>
                  <v10:StreetLines>RECIPIENT ADDRESS LINE 2</v10:StreetLines>
                  <v10:City>DENVER</v10:City>
                  <v10:StateOrProvinceCode>CO</v10:StateOrProvinceCode>
                  <v10:PostalCode>80204</v10:PostalCode>
                  <v10:UrbanizationCode>CO</v10:UrbanizationCode>
                  <v10:CountryCode>US</v10:CountryCode>
                  <v10:Residential>0</v10:Residential>
               </v10:Address>
            </v10:Recipient>
            <v10:RecipientLocationNumber>DEN001</v10:RecipientLocationNumber>
            <v10:Origin>
               <v10:Contact>
                  <v10:ContactId>RBB1057</v10:ContactId>
                  <v10:PersonName>ROHIT BORSE</v10:PersonName>
                  <v10:Title>Mr.</v10:Title>
                  <v10:CompanyName>DEOYAROHIT0705$</v10:CompanyName>
                  <v10:PhoneNumber>9762308621</v10:PhoneNumber>
                  <v10:PhoneExtension>02033469</v10:PhoneExtension>
                  <v10:PagerNumber>9762308621</v10:PagerNumber>
                  <v10:FaxNumber>9762308621</v10:FaxNumber>
                  <v10:EMailAddress>Rohit*Borse@DeoyaRohit.com</v10:EMailAddress>
               </v10:Contact>
               <v10:Address>
                  <v10:StreetLines>ORIGIN ADDRESS LINE 1</v10:StreetLines>
                  <v10:StreetLines>ORIGIN ADDRESS LINE 2</v10:StreetLines>
                  <v10:City>COLORADO SPRINGS</v10:City>
                  <v10:StateOrProvinceCode>CO</v10:StateOrProvinceCode>
                  <v10:PostalCode>80915</v10:PostalCode>
                  <v10:UrbanizationCode>CO</v10:UrbanizationCode>
                  <v10:CountryCode>US</v10:CountryCode>
                  <v10:Residential>0</v10:Residential>
               </v10:Address>
            </v10:Origin>
            <v10:ShippingChargesPayment>
               <v10:PaymentType>SENDER</v10:PaymentType>
               <v10:Payor>
                  <v10:AccountNumber></v10:AccountNumber>
                  <v10:CountryCode>US</v10:CountryCode>
               </v10:Payor>
            </v10:ShippingChargesPayment>
            <v10:SpecialServicesRequested>
               <v10:SpecialServiceTypes>HOLD_AT_LOCATION</v10:SpecialServiceTypes>
               <v10:HoldAtLocationDetail>
                  <v10:PhoneNumber>9762308621</v10:PhoneNumber>
                  <v10:LocationContactAndAddress>
                     <v10:Contact>
                        <v10:ContactId>DRB0705</v10:ContactId>
                        <v10:PersonName>DEOYANEE BHADANE</v10:PersonName>
                        <v10:Title>Ms.</v10:Title>
                        <v10:CompanyName>DEOYAROHIT0705</v10:CompanyName>
                        <v10:PhoneNumber>9762308621</v10:PhoneNumber>
                        <v10:PhoneExtension>02033469</v10:PhoneExtension>
                        <v10:PagerNumber>9762308621</v10:PagerNumber>
                        <v10:FaxNumber>9762308621</v10:FaxNumber>
                        <v10:EMailAddress>Rohit*Borse@syntelinc.com</v10:EMailAddress>
                     </v10:Contact>
                     <v10:Address>
                        <v10:StreetLines>HAL ADDRESS LINE 1</v10:StreetLines>
                        <v10:StreetLines>HAL ADDRESS LINE 2</v10:StreetLines>
                        <v10:City>DENVER</v10:City>
                        <v10:StateOrProvinceCode>CO</v10:StateOrProvinceCode>
                        <v10:PostalCode>80202</v10:PostalCode>
                        <v10:UrbanizationCode>CO</v10:UrbanizationCode>
                        <v10:CountryCode>US</v10:CountryCode>
                        <v10:Residential>0</v10:Residential>
                     </v10:Address>
                  </v10:LocationContactAndAddress>
                  <v10:LocationType>FEDEX_EXPRESS_STATION</v10:LocationType>
               </v10:HoldAtLocationDetail>
            </v10:SpecialServicesRequested>
            <v10:DeliveryInstructions>DeliveryInstructions</v10:DeliveryInstructions>
            <v10:PickupDetail>
               <v10:ReadyDateTime>2011-06-15T10:57:25-06:00</v10:ReadyDateTime>
               <v10:LatestPickupDateTime>2011-06-15T10:57:25-06:00</v10:LatestPickupDateTime>
               <v10:CourierInstructions>PickupCourierInstructions</v10:CourierInstructions>
               <v10:RequestType>SAME_DAY</v10:RequestType>
               <v10:RequestSource>CUSTOMER_SERVICE</v10:RequestSource>
            </v10:PickupDetail>
            <v10:BlockInsightVisibility>1</v10:BlockInsightVisibility>
            <v10:ErrorLabelBehavior>STANDARD</v10:ErrorLabelBehavior>
            <v10:LabelSpecification>
               <v10:LabelFormatType>COMMON2D</v10:LabelFormatType>
               <v10:ImageType>PNG</v10:ImageType>
               <v10:LabelStockType>PAPER_4X6</v10:LabelStockType>
               <v10:LabelPrintingOrientation>TOP_EDGE_OF_TEXT_FIRST</v10:LabelPrintingOrientation>
            </v10:LabelSpecification>
            <v10:RateRequestTypes>ACCOUNT</v10:RateRequestTypes>
            <v10:PackageCount>1</v10:PackageCount>
            <v10:RequestedPackageLineItems>
               <v10:SequenceNumber>1</v10:SequenceNumber>
               <v10:GroupNumber>1</v10:GroupNumber>
               <v10:GroupPackageCount>1</v10:GroupPackageCount>
               <v10:Weight>
                  <v10:Units>LB</v10:Units>
                  <v10:Value>60</v10:Value>
               </v10:Weight>
               <v10:Dimensions>
                  <v10:Length>12</v10:Length>
                  <v10:Width>12</v10:Width>
                  <v10:Height>12</v10:Height>
                  <v10:Units>IN</v10:Units>
               </v10:Dimensions>
               <v10:PhysicalPackaging>BAG</v10:PhysicalPackaging>
               <v10:ItemDescription>ItemDescription</v10:ItemDescription>
               <v10:CustomerReferences>
                  <v10:CustomerReferenceType>CUSTOMER_REFERENCE</v10:CustomerReferenceType>
                  <v10:Value>CUSTREF10570705</v10:Value>
               </v10:CustomerReferences>
               <v10:CustomerReferences>
                  <v10:CustomerReferenceType>P_O_NUMBER</v10:CustomerReferenceType>
                  <v10:Value>PO10570705</v10:Value>
               </v10:CustomerReferences>
               <v10:CustomerReferences>
                  <v10:CustomerReferenceType>INVOICE_NUMBER</v10:CustomerReferenceType>
                  <v10:Value>IO10570705</v10:Value>
               </v10:CustomerReferences>
 <v10:SpecialServicesRequested>
                  <v10:SpecialServiceTypes>SIGNATURE_OPTION</v10:SpecialServiceTypes>
                  <v10:SignatureOptionDetail>
                     <v10:OptionType>ADULT</v10:OptionType>
                     <v10:SignatureReleaseNumber>SRN1234567</v10:SignatureReleaseNumber>
                  </v10:SignatureOptionDetail>
               </v10:SpecialServicesRequested>
               <v10:ContentRecords>
                  <v10:PartNumber>PRTNUM01</v10:PartNumber>
                  <v10:ItemNumber>ITMNUM01</v10:ItemNumber>
                  <v10:ReceivedQuantity>15</v10:ReceivedQuantity>
                  <v10:Description>ContentDescription</v10:Description>
               </v10:ContentRecords>
            </v10:RequestedPackageLineItems>
         </v10:RequestedShipment>
      </v10:ProcessShipmentRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>